Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/legal_matters_and_health/legal_arrangements_for_incapacity.html.txt.tmx
Source language: en
Languages: ga

source: Legal arrangements for incapacity
ga: Socruithe Dlíthiúla maidir le hÉagumas

source: There may be many reasons why you are unable to deal with your affairs
ga: Mar shampla, d’fhéadfadh nach mbeadh cumas fisiciúil agat do phinsean a bhailiú

source: For example, you may be physically unable to collect your pension or you may acquire an illness or disability that limits your ability to make decisions
ga: D’fhéadfadh go mbeadh tinneas ort nó go mbeadh míchumas agat a chuireann srian leis an gcumas atá agat cinntí oibiachtúla a dhéanamh

source: If you become incapable of dealing with your affairs, for whatever reason, there are various legal arrangements you can make to have someone else do these things on your behalf
ga: Mura bhfuil tú in ann déileáil le do ghnóthaí, ar chúis ar bith, tá socruithe dlíthiúla éagsúla ann is féidir leat a dhéanamh chun cead a thabhairt do dhuine eile na nithe sin a dhéanamh thar do cheann

source: The choice of legal arrangements open to you depends on your precise circumstances
ga: Braitheann an rogha socruithe dlíthiúla atá ar fáil duit ar do chúinsí beachta féin

source: Some of the arrangements are very simple to make and have limited effect, for example, appointing an agent to collect your social welfare payment
ga: Tá sé an-simplí roinnt de na socruithe a dhéanamh agus is beag an difear a dhéanann siad - mar shampla, gníomhaire a cheapadh chun do phinsean leasa shóisialaigh a bhailiú

source: Others are much more complex and require the help of legal and medical professionals, for example, executing an enduring power of attorney
ga: Tá socruithe eile ann atá i bhfad níos casta ná sin agus tá cuidiú gairmithe dlí agus leighis ag teastáil ina leith - mar shampla, cumhacht mharthanach aturnae a fhorghníomhú

source: It is advisable to take legal advice before entering into the more complex arrangements
ga: Moltar duit comhairle dlí a fháil sula rachaidh tú isteach i socruithe casta

source: With the exception of the Wards of Court procedure, you must make all of these arrangements while you are mentally competent
ga: Ní mór duit na socruithe uile sin a dhéanamh - seachas nós imeachta na gCoimircithe Cúirte – agus tú inniúil ó thaobh meabhrach de

source: Some arrangements are only effective while you remain mentally competent, some continue even if you become mentally incompetent, while others, specifically the enduring power of attorney, are designed for dealing with the situation that arises when you cease to be mentally competent
ga: Níl éifeacht ag socruithe áirithe ach amháin le linn duit bheith inniúil ó thaobh meabhrach de; tá éifeacht ag socruithe eile, go háirithe an t-iontaobhas, fiú amháin má éiríonn tú neamhinniúil ó thaobh meabhrach de; agus tá cinn eile, go háirithe an chumhacht mharthanach aturnae, deartha chun déileáil lena dtagann chun cinn nuair a scoireann tú de bheith inniúil ó thaobh meabhrach de

source: The Wards of Court procedure differs from all the others in that it may be imposed on you
ga: Tá nós imeachta na gCoimircithe Cúirte éagsúil leis na socruithe eile sa mhéid go bhféadfar é sin a fhorchur ort

source: Assisted Decision-Making (Capacity) Act 2015
ga: An tAcht um Chinnteoireacht Chuidithe (Cumas), 2015

source: The Assisted Decision-Making (Capacity) Act 2015 was signed into law on 30 December 2015 but has not yet been commenced to bring it into effect
ga: Síníodh an tAcht um Chinnteoireacht Chuidithe (Cumas), 2015 isteach sa dlí an 30 Nollaig 2015 ach níor cuireadh tús le héifeacht a thabhairt dó go fóill

source: When it is commenced it will provide for new legal arrangements by which people can be assisted to make decisions about their welfare and their property and affairs
ga: Nuair a chuirfear tús leis, forálfaidh sé do shocruithe nua dlíthiúla trínár féidir cabhrú le daoine nuair a bhíonn cinntí á ndéanamh acu faoina leas agus faoina maoin agus gnóthaí

source: This assistance and support is particularly required where the person lacks, or may lack, the capacity to make the decision unaided
ga: Teastaíonn an cúnamh agus an tacaíocht seo, ach go háirithe, nuair nach bhfuil ar chumas, nó nuair a d’fhéadfadh nach bhfuil ar chumas, an duine chun an cinneadh a dhéanamh gan chúnamh

source: The new arrangements include Assisted Decision-Making and Co-Decision-Making and a process is also set out for a court to appoint a Decision-Making Representative for an individual
ga: I measc na socruithe nua, tá Cinnteoireacht agus Comhchinnteoireacht Chuidithe agus tá próiseas leagtha amach, chomh maith, ina gceapfaidh cúirt Ionadaí Cinnteoireachta do dhuine aonair

source: As well as introducing new decision-making procedures, the Act sets out new arrangements for Wards of Court and for people who wish to make an enduring power of attorney
ga: Anuas ar nósanna imeachta nua cinnteoireachta a thabhairt isteach, leagtar amach san Acht, chomh maith, socruithe nua do Choimircithe Cúirte agus do dhaoine ar mian leo cumhacht sheasmhach aturnae a dhéanamh

source: A Decision Support Service is to be set up within the Mental Health Commission to provide a range of functions in relation to the new arrangements
ga: Tá Seirbhísí Tacaíochta Cinntí le bunú laistigh den Choimisiún Meabhair-Shláinte chun réimse feidhmeanna a sholáthar maidir leis na socruithe nua

source: Read more about the Assisted Decision-Making (Capacity) Act 2015 (pdf)
ga: Is féidir níos mó a léamh faoin Acht um Chinnteoireacht Chuidithe (Cumas), 2015 (pdf)

source: If you appoint another person to represent you in certain dealings with third parties, you are making an agency arrangement
ga: Má cheapann tú duine eile chun ionadaíocht a dhéanamh duit i ndéileálacha áirithe le tríú páirtithe, is é socrú gníomhaireachta atá á dhéanamh agat

source: You are called the principal and the person you appoint is called the agent or appointed representative
ga: Tugtar an príomhaí ort agus tugtar an gníomhaire nó an t-ionadaí ceaptha ar an duine a cheapann tú

source: The most usual example is where a pensioner nominates someone to collect social welfare pension payments or other allowances from the post office
ga: Is é an sampla is coitianta de sin ná cásanna ina n-ainmníonn pinsinéir duine éigin chun íocaíochtaí pinsean leasa shóisialaigh nó liúntais eile a bhailiú ó oifig an phoist

source: Another example of an agency arrangement is where you appoint a friend or family member as an agent to manage your financial affairs or pay bills while you are abroad for a period
ga: Sampla eile de shocrú gníomhaireachta is ea cásanna ina gceapann tú cara nó ball teaghlaigh mar ghníomhaire chun do ghnóthaí airgeadais a bhainistiú, billí a íoc, an teach a árachú, etc., agus tú thar lear ar feadh tréimhse

source: You may appoint a professional to do these things and pay for the service – this is not an agency arrangement but is a contract for services
ga: Is féidir leat gairmí a cheapadh chun na nithe sin a dhéanamh agus íoc as an tseirbhís – sa chás sin, is é conradh i gcomhair sheirbhísí, agus ní socrú gníomhaireachta, atá á dhéanamh agat

source: If you are suffering from physical incapacity, your bank may allow you to carry out a third-party mandate
ga: Má tá tú ar éagumas fisiciúil, d’fhéadfadh go dtabharfadh do bhanc cead duit sainordú tríú páirtí a dhéanamh

source: This authorises your agent to perform certain functions, for example, to write cheques on your behalf
ga: Tugann sé sin údarás do do ghníomhaire feidhmeanna áirithe a chomhlíonadh, mar shampla, seiceanna a scríobh thar do cheann

source: You may only make an agency arrangement while you are mentally competent and the arrangement usually only lasts while you remain mentally competent
ga: Ní féidir leat socrú gníomhaireachta a dhéanamh ach amháin le linn duit bheith inniúil ó thaobh meabhrach de agus, i bhformhór na gcásanna, ní bhíonn an socrú ar bun ach amháin le linn duit bheith inniúil ó thaobh meabhrach de

source: The arrangement does not have to be in writing unless the agent is required to sell property on your behalf
ga: Ní gá an socrú a chur i scríbhinn ach amháin i gcásanna ina n-éilítear ar an ngníomhaire réadmhaoin a dhíol thar do cheann

source: It is nevertheless advisable to put the arrangement in writing so that both you and the agent are clear about what is intended and what powers the agent has
ga: Ina ainneoin sin, moltar duit an socrú a chur i scríbhinn ionas go mbeidh tuiscint shoiléir agat agus ag do ghníomhaire araon ar a bhfuil i gceist agus ar na cumhachtaí atá ag an ngníomhaire

source: Agency arrangements for social welfare payments
ga: Socruithe gníomhaireachta i gcomhair íocaíochtaí Leasa Shóisialaigh

source: The Department of Social Protection has the power under social welfare legislation to make payments to a third party acting on behalf of a social welfare recipient
ga: Faoin reachtaíocht leasa shóisialaigh, tá sé de chumhacht ag an Roinn Coimirce Sóisialaí íocaíochtaí a dhéanamh le tríú páirtí atá ag gníomhú thar ceann duine atá ag fáil leas sóisialach

source: The legal status of a social welfare agency relationship is different from the general agency relationship in that the social welfare agency may be put in place or may continue in operation if you become mentally incapable
ga: Tá stádas dlíthiúil an chaidrimh ghníomhaireachta leasa shóisialaigh éagsúil leis an gcaidreamh gníomhaireachta ginearálta sa mhéid go bhféadfar an ghníomhaireacht leasa shóisialaigh a chur i bhfeidhm, nó go bhféadfar leanúint leis an ngníomhaireacht leasa shóisialaigh, i gcásanna ina n-éiríonn tú neamhchumasach ó thaobh meabhrach de

source: If an agent is appointed to collect the money, it is still your money and there is a legal duty on the agent to use it on your behalf and for your benefit
ga: Má cheaptar gníomhaire chun an t-airgead a bhailiú, is leatsa an t-airgead go fóill agus tá dualgas dlíthiúil ar an ngníomhaire chun é a úsáid thar do cheann agus ar mhaithe leat féin

source: The Department of Social Protection may end the agency arrangement at any time where it has reason to believe that the arrangement is not working satisfactorily
ga: Féadfaidh an Roinn Coimirce Sóisialaí deireadh a chur leis an socrú gníomhaireachta ag aon tráth nuair a bhíonn údar aici a chreidiúint nach bhfuil ag éirí go sásúil leis an socrú

source: There are 3 different types of social welfare agency arrangements
ga: Tá 3 shaghas éagsúla de shocruithe gníomhaireachta leasa shóisialaigh ann

source: If you are unable to collect your payment at a post office for a short period of time, usually no longer than 3 weeks, a temporary agent can be appointed by completing a Temporary Agent Form which is available at the post office
ga: Mura féidir leat d’íocaíocht a bhailiú ag oifig an phoist do thréimhse ghearr ama, de ghnáth nach faide ná 3 seachtaine, féadtar gníomhaire sealadach a cheapadh trí Fhoirm Ghníomhaire Shealadaigh a chomhlánú atá ar fáil in oifig an phoist

source: When collecting your payment the agent presents this form along with your social services card
ga: Nuair a bhailíonn tú d’íocaíocht, soláthraíonn an gníomhaire an fhoirm seo, i dteannta do chárta seirbhísí sóisialacha

source: Nominating an agent to collect your payment
ga: Gníomhaire a ainmniú chun d’íocaíocht a bhailiú

source: If you are unable to collect your payment at a post office, due to an illness or loss of mobility for example, you can nominate a person to do this on your behalf by completing and returning the form Authority to Appoint an Agent (pdf)
ga: Mura féidir leat d’íocaíocht a bhailiú ag oifig an phoist, i ngeall ar bhreoiteacht nó caillteanas luaineachta, mar shampla, féadfaidh tú duine a ainmniú chun seo a dhéanamh thar do cheann tríd an bhfoirm Údarás chun Gníomhaire a Cheapadh (pdf) a chomhlánú agus a sheoladh ar ais

source: Arrangements are made with the post office to facilitate the agent collecting the payment and you are notified of this
ga: Déantar socruithe le hoifig an phoist chun an gníomhaire a bhaileoidh an íocaíocht a éascú agus tugtar fógra duit faoi seo

source: If you are not able to manage your financial affairs
ga: Mura féidir leat do ghnóthaí féin airgeadais a bhainistiú

source: If you are not able to manage your financial affairs, an agent may be appointed to collect your payment and act on your behalf
ga: Mura féidir leat do ghnóthaí féin airgeadais a bhainistiú, féadtar gníomhaire a cheapadh chun d’íocaíocht a bhailiú agus gníomhú thar do cheann

source: In this case a medical practitioner must certify that you do not have the capacity to manage your financial affairs
ga: Sa chás seo, caithfidh cleachtóir leighis a dheimhniú nach bhfuil ar do chumas do ghnóthaí airgeadais a bhainistiú

source: There is a section for this certification on the Authority to Appoint an Agent form (pdf)
ga: Tá mír ann don deimhniúchán seo san Údarás chun Gníomhaire a Cheapadh (pdf)

source: The agent nominated is often a family member, a care representative or a representative of a nursing home or hospital
ga: Is gnách gur duine muinteartha, ionadaí cúraim nó ionadaí de theach altranais nó d’ospidéal an gníomhaire a ainmnítear

source: The payment is made electronically to a nominated bank account
ga: Déantar an íocaíocht go leictreonach le cuntas bainc a ainmnítear

source: It is recommended that a separate account be set up for this purpose
ga: Moltar go n-osclaítear cuntas ar leith don chuspóir seo

source: In the case of a Ward of Court or an attorney appointed under an enduring power of attorney (see below), the Department of Social Protection will make payments directly to the Committee of the Ward or to the attorney by nominating them as agent for the social welfare recipient
ga: I gcás coimircí cúirte nó aturnae arna c(h)eapadh faoi chumhacht mharthanach aturnae, déanfaidh an Roinn Coimirce Sóisialaí íocaíochtaí go díreach le Coiste an Choimircí nó leis an Aturnae tríd an gCoiste nó tríd an nGníomhaire a ainmniú mar ghníomhaire don duine atá ag fáil leas sóisialach

source: All such payments will be made electronically to a nominated bank account
ga: Déanfar gach íocaíocht den sórt seo go leictreonach le cuntas bainc a ainmnítear

source: Appointed agents have a legal duty to ensure the money is used for your benefit and they must also deal with other aspects of your social welfare payment
ga: Tá dualgas dlíthiúil ar ghníomhairí a cheaptar lena chinntiú go n-úsáidtear an t-airgead ar mhaithe le do thairbhe féin agus caithfidh siad déileáil, chomh maith, le gnéithe eile de d’íocaíocht leasa shóisialaigh

source: This includes notifying the Department of Social Protection of changes to your circumstances
ga: Áirítear leis seo an Roinn Coimirce Sóisialaí a chur ar an eolas ar athruithe a thagann ar do chúinsí

source: A power of attorney is a document in which you (the donor) authorise another person (the donee or attorney) to act for you in certain matters – on your behalf and in your name – in accordance with the terms set out in the document
ga: Is é is cumhacht aturnae ann ná cáipéis ina dtugann tú (an deontóir) údarás do dhuine eile (an deontaí nó an t-aturnae) gníomhú duit - thar do cheann agus i d’ainm - i gcásanna áirithe de réir na dtéarmaí atá leagtha amach sa cháipéis

source: A power of attorney can be specific (limited to a particular purpose, for example, sale of your house in your absence) or general (entitling the attorney to do almost everything that you yourself could do)
ga: Mar shampla, is féidir leat cumhacht aturnae a thabhairt do dhuine chun réadmhaoin a cheannach nó a dhíol. D’fhéadfadh gur chumhacht an-leathan é sin nó d’fhéadfadh go mbeadh coinníollacha fairsinge ag gabháil léi

source: A power of attorney must always be in writing
ga: Caithfidh cumhacht aturnae a bheith i scríbhinn i gcónaí

source: There are two kinds of power of attorney:
ga: Tá dhá shaghas de chumhacht aturnae ann:

source: • Power of attorney which gives either a specific or a general power and ceases as soon as the donor becomes incapacitated
ga: • Cumhacht aturnae a bhronnann cumhacht ar leith nó ghinearálta agus a gcuirtear deireadh léi a luaithe a bhíonn an deontóir éagumasaithe

source: • Enduring power of attorney which takes effect on the incapacity of the donor
ga: • Cumhacht aturnae sheasmhach a mbíonn éifeacht aici ar éagumas an deontóra

source: Read more about power of attorney
ga: Is féidir níos mó a léamh faoi chumhacht aturnae anseo

source: Property, including money assets, may be held in trust on behalf of another person or to achieve a particular purpose
ga: Féadfaidh réadmhaoin, lena n-áirítear sócmhainní airgid, a shealbhú ar iontaobhas thar ceann duine eile nó chun cuspóir ar leith a bhaint amach

source: A trust exists when a person (the trustee) holds the property of another (the settlor) for the benefit of named people
ga: Tá iontaobhas ann i gcásanna ina sealbhaíonn duine (an t-iontaobhaí) réadmhaoin duine eile (an gabhálaí) chun tairbhe daoine áirithe

source: The beneficiaries may be the settlor or may be other people
ga: D’fhéadfadh go mbeadh an gabhálaí é/í féin ina t(h)airbhí nó d’fhéadfadh go mbeadh daoine eile ina dtairbhithe ina leith sin

source: By creating a trust you can ensure that, should you subsequently become mentally incompetent, your affairs will be managed in a particular manner
ga: Agus iontaobhas á chruthú agat, is féidir leat a chinntiú go mbainisteofar do ghnóthaí ar bhealach ar leith má éiríonn tú neamhinniúil ó thaobh meabhrach de ina dhiaidh sin

source: The trust continues to be administered by the trustee for your benefit without the necessity to have you made a ward of court
ga: Leanann an t-iontaobhaí le réadmhaoin an iontaobhais a riar chun do thairbhe gan gá a bheith ann le coimircí cúirte a dhéanamh díot

source: A trust is also a useful tool if you have a child with a disability and you want to ensure that they will be cared for if you become incapable or after your death
ga: Uirlis úsáideach is ea iontaobhas freisin i gcásanna ina bhfuil leanbh faoi mhíchumas agat agus inar mhaith leat a chinntiú go dtabharfar aire dó/di má éiríonn tú neamhchumasach nó má fhaigheann tú bás

source: Trusts are legally complex and have tax implications so you should take legal and tax advice
ga: Tá iontaobhais casta ó thaobh an dlí de agus tá impleachtaí cánach ag gabháil leo

source: There are different kinds of trusts of which the most usual are express trusts and discretionary trusts
ga: Is iad iontaobhais shainráite agus iontaobhais lánroghnacha na cineálacha is coitianta díobh

source: Discretionary trusts are especially useful if you want to provide for an incapacitated child without affecting their entitlement to State benefits
ga: Tá iontaobhais lánroghnacha an-úsáideach i gcásanna inar mhaith leat soláthar a dhéanamh do leanbh éagumasaithe gan difear a dhéanamh don teidlíocht atá aige/aici do shochair stáit

source: Certain trust funds for permanently incapacitated people may have tax exemptions
ga: D’fhéadfadh díolúintí cánach a bheith ag cistí iontaobhais áirithe do dhaoine atá faoi éagumas buan

source: When a person becomes unable to manage his or her assets because of mental incapacity, an application can be made to the courts for them to become a Ward of Court
ga: Nuair nach mbíonn ar chumas duine a s(h)ócmhainní a bhainistiú mar gheall ar éagumas meabhrach, féadtar iarratas a dhéanamh ar na cúirteanna go ndéantar Coimircí Cúirte den duine seo

source: The court must make a decision as to whether the person is capable of managing their own property for their own benefit and the benefit of their dependants
ga: Caithfidh an chúirt cinneadh a dhéanamh maidir le cé acu an bhfuil nó nach bhfuil ar chumas an duine a maoin féin a bhainistiú ar mhaithe lena dtairbhe féin agus le tairbhe a gcleithiúnaithe

source: If it is decided that the person cannot manage their own property because of mental incapacity a Committee is appointed to control the assets on the Ward's behalf
ga: Má chinntear nach féidir leis an duine a maoin féin a bhainistiú mar gheall ar éagumas meabhrach, ceaptar Coiste chun na sócmhainní seo a rialú thar ceann an Choimircí

source: Read more about what a Ward of Court is and how to apply to have someone made a Ward of Court
ga: Is féidir leat níos mó a léamh faoi cad atá i gceist le Coimircí Cúirte agus conas iarratas a dhéanamh go ndéantar Coimircí Cúirte de dhuine éigin
